case/outputs_steady/openfoam_cases/section_1_x20p3km/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| SHCT->OpenFOAM coupling — auto-generated case                              |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues ( volScalarFieldValue alpha.liquid 0 );

regions
(
    boxToCell
    {
        box (-0.12552 -0.12552 -0.01) (0.12552 -0.048565 3.0225);
        fieldValues ( volScalarFieldValue alpha.liquid 1 );
    }
);
